# EqualityConstraintsUnsatisfied Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..EqualityConstraintsUnsatisfied Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Equality constraints are not satisfied. The action either violates a locked constraint or tries to modify a sketch based object outside of the sketch mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EqualityConstraintsUnsatisfied { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EqualityConstraintsUnsatisfied As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EqualityConstraintsUnsatisfied {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace